Revit 2027 API
EnergyAnalysisOpeningType Enumeration
 Energy analysis opening type.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum EnergyAnalysisOpeningType
Public Enumeration EnergyAnalysisOpeningType
public enum class EnergyAnalysisOpeningType
type EnergyAnalysisOpeningType
Members
Member name | Value | Description
Air | 3 |  Air.
Door | 0 |  Door.
Skylight | 2 |  Skylight.
Window | 1 |  Window.
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace